{
  "movies": [
    {
      "movieId": "177675",
      "name": "2001: A Space Odyssey",
      "description" : "An imposing black structure provides a connection between the past and the future in this enigmatic adaptation of a short story by revered sci-fi author Arthur C. Clarke."
    },
    {
      "movieId": "567933",
      "name": "Gravity",
      "description": "Dr. Ryan Stone (Sandra Bullock) is a medical engineer on her first shuttle mission. Her commander is veteran astronaut Matt Kowalsky (George Clooney), helming his last flight before retirement. Then, during a routine space walk by the pair, disaster strikes: The shuttle is destroyed, leaving Ryan and Matt stranded in deep space with no link to Earth and no hope of rescue. As fear turns to panic, they realize that the only way home may be to venture further into space."
    },
    {
      "movieId": "822512",
      "name": "Guardians of the Galaxy",
      "description": "Brash space adventurer Peter Quill (Chris Pratt) finds himself the quarry of relentless bounty hunters after he steals an orb coveted by Ronan, a powerful villain. To evade Ronan, Quill is forced into an uneasy truce with four disparate misfits: gun-toting Rocket Raccoon, treelike-humanoid Groot, enigmatic Gamora, and vengeance-driven Drax the Destroyer. But when he discovers the orb's true power and the cosmic threat it poses, Quill must rally his ragtag group to save the universe."
    },
    {
      "movieId": "894960",
      "name": "The Martian",
      "description" : "When astronauts blast off from the planet Mars, they leave behind Mark Watney (Matt Damon), presumed dead after a fierce storm. With only a meager amount of supplies, the stranded visitor must utilize his wits and spirit to find a way to survive on the hostile planet. Meanwhile, back on Earth, members of NASA and a team of international scientists work tirelessly to bring him home, while his crew mates hatch their own plan for a daring rescue mission."
    },
    {
      "movieId": "333377",
      "name": "Arrival",
      "description" : "Linguistics professor Louise Banks (Amy Adams) leads an elite team of investigators when gigantic spaceships touch down in 12 locations around the world. As nations teeter on the verge of global war, Banks and her crew must race against time to find a way to communicate with the extraterrestrial visitors. Hoping to unravel the mystery, she takes a chance that could threaten her life and quite possibly all of mankind."
    },
    {
      "movieId": "101254",
      "name": "Interstellar",
      "description" : "In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand (Michael Caine), a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper (Matthew McConaughey) and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home."
    },
    {
      "movieId": "799874",
      "name": "Moon",
      "description" : "Astronaut Sam Bell's (Sam Rockwell) three-year shift at a lunar mine is finally coming to an end, and he's looking forward to his reunion with his wife (Dominique McElligott) and young daughter. Suddenly, Sam's health takes a drastic turn for the worse. He suffers painful headaches and hallucinations, and almost has a fatal accident. He meets what appears to be a younger version of himself, possibly a clone. With time running out, Sam must solve the mystery before the company crew arrives."
    },
    {
      "movieId": "671014",
      "name": "Alien",
      "description" : "In deep space, the crew of the commercial starship Nostromo is awakened from their cryo-sleep capsules halfway through their journey home to investigate a distress call from an alien vessel. The terror begins when the crew encounters a nest of eggs inside the alien ship. An organism from inside an egg leaps out and attaches itself to one of the crew, causing him to fall into a coma."
    },
    {
      "movieId": "614311",
      "name": "Close Encounters of the Third Kind",
      "description" : "Roy Neary (Richard Dreyfuss) witnesses an unidentified flying object, and even has a sunburn from its bright lights to prove it. Roy refuses to accept an explanation for what he saw and is prepared to give up his life to pursue the truth about UFOs."
    }
  ]
}